"""
Метод: format
------
Провести валідацію списку телефонів
Телефон: +380501234567 Де: +380 код країни телефон 501234567
Вважаємо, що код валідний з кодом і без коду
"""
phone_storage = ["380669640547", "0637306465 ", " 380961935171", "632643973", "050832520 ",
                "000000000", "48730283918", "986223575", "375297947963", "+38(050)123-32-34", "38(050)123 32 34",
                "38(050)123 32 3b"]

codes_operators = {"067", "068", "096", "097", "098",
                  "050", "066", "095", "099", "063", "073", "093"}
